Repository: utaschulz1/patent-translation-agent
Catalog: Matecat/HUAW_old/HUAW_old.tmx
Source language: en_us
Languages: de_de

source: 8. A communication apparatus (101), comprising at least one processor and a communication interface, wherein the communication interface is configured to input and/or output a signal, and the at least one processor is configured to execute a computer program stored in a memory, to enable the communication apparatus to implement the method according to any one of claims 4 to 6, and wherein the communication apparatus is a network device or a component of a network device.
de_de: 8. Kommunikationsvorrichtung (101), die mindestens einen Prozessor und eine Kommunikationsschnittstelle umfasst, wobei die Kommunikationsschnittstelle zum Eingeben und/oder Ausgeben eines Signals konfiguriert ist und der mindestens eine Prozessor zum Ausführen eines in einem Speicher gespeicherten Computerprogramms konfiguriert ist, um die Kommunikationsvorrichtung in die Lage zu versetzen, das Verfahren nach einem der Ansprüche 4 bis 6 zu implementieren, und wobei die Kommunikationsvorrichtung ein Netzwerkgerät oder eine Komponente eines Netzwerkgeräts ist.

source: 9. A computer-readable medium, comprising a computer program, wherein when the computer program is run on the communication apparatus (102, …, 107) of claim 7, the communication apparatus is enabled to perform the method according to any one of claims 1 to 3.
de_de: 9. Computerlesbares Medium, das ein Computerprogramm umfasst, wobei, wenn das Computerprogramm auf einer Kommunikationsvorrichtung (102, ..., 107) nach Anspruch 7 läuft, die Kommunikationsvorrichtung in die Lage versetzt wird, das Verfahren gemäß einem der Ansprüche 1 bis 3 durchzuführen.

source: A computer-readable medium, comprising a computer program, wherein when the computer program is run on the communication apparatus (101) of claim 8, the communication apparatus is enabled to perform the method according to any one of claims 4 to 6.
de_de: Computerlesbares Medium, das ein Computerprogramm umfasst, wobei, wenn das Computerprogramm auf einer Kommunikationsvorrichtung (101) nach Anspruch 8 läuft, die Kommunikationsvorrichtung in die Lage versetzt wird, das Verfahren gemäß einem der Ansprüche 4 bis 6 durchzuführen.

source: A computer program product, comprising a computer program, wherein when the computer program is executed by the communication apparatus (102, …, 107) of claim 7, the communication apparatus is enabled to perform the method according to any one of claims 1 to 3.
de_de: Computerprogrammprodukt, das ein Computerprogramm umfasst, wobei, wenn das Computerprogramm von einer Kommunikationsvorrichtung (102, ..., 107) nach Anspruch 7 ausgeführt wird, die Kommunikationsvorrichtung in die Lage versetzt wird, das Verfahren gemäß einem der Ansprüche 1 bis 3 durchzuführen.

source: A computer program product, comprising a computer program, wherein when the computer program is executed by the communication apparatus (101) of claim 8, the communication apparatus is enabled to perform the method according to any one of claims 4 to 6.
de_de: Computerprogrammprodukt, das ein Computerprogramm umfasst, wobei, wenn das Computerprogramm von einer Kommunikationsvorrichtung (101) nach Anspruch 8 ausgeführt wird, die Kommunikationsvorrichtung in die Lage versetzt wird, das Verfahren gemäß einem der Ansprüche 4 bis 6 durchzuführen.

source: 1. A dial-up packet processing method, applied to a control plane network element in a dial-up packet processing system, wherein the system comprises a controller, an access gateway, a forwarding plane network element, and the control plane network element that are connected to each other, and the method comprises:
de_de: 1. Einwahlpaket-Verarbeitungsverfahren, das auf ein Steuerungsebenen-Netzwerkelement in einem Einwahlpaket-Verarbeitungssystem angewendet wird, wobei das System eine Steuerung, ein Zugangs-Gateway, ein Weiterleitungsebenen-Netzwerkelement und das Steuerungsebenen-Netzwerkelement umfasst, die miteinander verbunden sind, und das Verfahren umfasst:

source: receiving (S401), by the control plane network element, a dial-up packet from the access gateway, wherein the dial-up packet is a dial-up packet sent by user equipment to the access gateway;
de_de: Empfangen (S401), durch das Steuerungsebenen-Netzwerkelement, eines Einwahlpakets von dem Zugangs-Gateway, wobei das Einwahlpaket ein Einwahlpaket ist, das von einem Benutzergerät an das Zugangs-Gateway gesendet wird;

source: sending (S403), by the control plane network element, an authentication request to an external server, wherein the authentication request is generated (S402) by the control plane network element based on the dial-up packet;
de_de: Senden (S403), durch das Steuerungsebenen-Netzwerkelement, einer Authentifizierungsanforderung an einen externen Server, wobei die Authentifizierungsanforderung durch das Steuerungsebenen-Netzwerkelement basierend auf dem Einwahlpaket erzeugt wird (S402);

source: receiving (S404), by the control plane network element, dial-up success information sent by the external server; and
de_de: Empfangen (S404), durch das Steuerungsebenen-Netzwerkelement, von Einwahlerfolgsinformationen, die durch den externen Server gesendet werden; und

source: determining (S405), by the control plane network element, the forwarding plane network element based on the dial-up success information, to enable the user equipment to perform network communication through the forwarding plane network element.
de_de: Bestimmen (S405), durch das Steuerungsebenen-Netzwerkelement, des Weiterleitungsebenen-Netzwerkelements basierend auf den Einwahlerfolgsinformationen, um das Benutzergerät in die Lage zu versetzen, Netzwerkkommunikation durch das Weiterleitungsebenen-Netzwerkelement durchzuführen.

source: 2. The method according to claim 1, wherein the dial-up packet comprises an internet protocol, IP, address of the user equipment, and after the determining (S405), by the control plane network element, the forwarding plane network element based on the dial-up success information, the method further comprises:
de_de: 2. Verfahren nach Anspruch 1, wobei das Einwahlpaket eine Internetprotokoll-, IP-, Adresse des Benutzergeräts umfasst, und das Verfahren nach dem Bestimmen (S405), durch das Steuerungsebenen-Netzwerkelement, des Weiterleitungsebenen-Netzwerkelements basierend auf den Einwahlerfolgsinformationen ferner Folgendes umfasst:

source: sending (S406), by the control plane network element, information about the forwarding plane network element to the controller, to enable the controller to send a tunnel establishment request to the access gateway, wherein the tunnel establishment request is generated by the controller based on the information about the forwarding plane network element, the tunnel establishment request is used to establish a first communication tunnel between the access gateway and the forwarding plane network element, and the first communication tunnel is in a correspondence with the IP address.
de_de: Senden (S406), durch das Steuerungsebenen-Netzwerkelement, von Informationen über das Weiterleitungsebenen-Netzwerkelement an die Steuerung, um die Steuerung in die Lage zu versetzen, eine Tunnelaufbauanforderung an das Zugangs-Gateway zu senden, wobei die Tunnelaufbauanforderung durch die Steuerung basierend auf den Informationen über das Weiterleitungsebenen-Netzwerkelement erzeugt wird, die Tunnelaufbauanforderung verwendet wird, um einen ersten Kommunikationstunnel zwischen dem Zugangs-Gateway und dem Weiterleitungsebenen-Netzwerkelement aufzubauen, und der erste Kommunikationstunnel in einer Korrenspondenz mit der IP-Adresse steht.

source: 3. The method according to claim 2, wherein the information about the forwarding plane network element comprises interface information of the forwarding plane network element and interface information of the access gateway.
de_de: 3. Verfahren nach Anspruch 2, wobei die Informationen über das Weiterleitungsebenen-Netzwerkelement Schnittstelleninformationen des Weiterleitungsebenen-Netzwerkelements und Schnittstelleninformationen des Zugangs-Gateways umfassen.

source: 4. The method according to claim 2 or 3, wherein when the IP address has been in a correspondence with a second communication tunnel, after the determining (S405), by the control plane network element, the forwarding plane network element based on the dial-up success information, the method further comprises:
de_de: 4. Verfahren nach Anspruch 2 oder 3, wobei, wenn die IP-Adresse in einer Korrespondenz mit einem zweiten Kommunikationstunnel gewesen ist, das Verfahren nach dem Bestimmen (S405), durch das Steuerungsebenen-Netzwerkelement, des Weiterleitungsebenen-Netzwerkelements basierend auf den Einwahlerfolgsinformationen ferner Folgendes umfasst:

source: sending, by the control plane network element, the information about the forwarding plane network element to the controller, to enable the controller to send a tunnel switch request to the access gateway, wherein the tunnel switch request is generated by the controller based on the information about the forwarding plane network element, the tunnel switch request is used to switch a communication tunnel corresponding to the IP address from the second communication tunnel to the first communication tunnel, and the second communication tunnel is a communication tunnel between the access gateway and another forwarding plane network element.
de_de: Senden, durch das Steuerungsebenen-Netzwerkelement, der Informationen über das Weiterleitungsebenen-Netzwerkelement an die Steuerung, um die Steuerung in die Lage zu versetzen, eine Tunnelumschaltanforderung an das Zugangs-Gateway zu senden, wobei die Tunnelumschaltanforderung durch die Steuerung basierend auf den Informationen über das Weiterleitungsebenen-Netzwerkelement erzeugt wird, die Tunnelumschaltanforderung verwendet wird, um einen Kommunikationstunnel, der mit der IP-Adresse korrespondiert, von dem zweiten Kommunikationstunnel zu dem ersten Kommunikationstunnel umzuschalten, und der zweite Kommunikationstunnel ein Kommunikationstunnel zwischen dem Zugangs-Gateway und einem anderen Weiterleitungsebenen-Netzwerkelement ist.

source: 5. The method according to any one of claims 1 to 4, wherein the dial-up success information comprises service level agreement SLA information corresponding to the IP address, and the determining (S405), by the control plane network element, the forwarding plane network element based on the dial-up success information comprises: determining, by the control plane network element, the forwarding plane network element based on the SLA information.
de_de: 5. Verfahren nach einem der Ansprüche 1 bis 4, wobei die Einwahlerfolgsinformationen Dienstgütevereinbarungs-, SLA-, Informationen umfassen, die der IP-Adresse entsprechen, und das Bestimmen (S405), durch das Steuerungsebenen-Netzwerkelement, des Weiterleitungsebenen-Netzwerkelements basierend auf den Einwahlerfolgsinformationen Folgendes umfasst: Bestimmen, durch das Steuerungsebenen-Netzwerkelement, des Weiterleitungsebenen-Netzwerkelements basierend auf den SLA-Informationen.

source: 6. The method according to any one of claims 1 to 5, wherein after the receiving, by the control plane network element, dial-up success information sent by the external server, the method further comprises:
de_de: 6. Verfahren nach einem der Ansprüche 1 bis 5, wobei nach dem Empfangen, durch das Steuerungsebenen-Netzwerkelement, von Einwahlerfolgsinformationen, die durch den externen Server gesendet werden, das Verfahren ferner Folgendes umfasst:

source: generating, by the control plane network element, session information based on the dial-up success information, wherein the session information corresponds to the IP address; and
de_de: Erzeugen, durch das Steuerungsebenen-Netzwerkelement, von Sitzungsinformationen basierend auf den Einwahlerfolgsinformationen, wobei die Sitzungsinformationen mit der IP-Adresse korrespondieren; und

source: sending, by the control plane network element, the session information to the forwarding plane network element, to enable the forwarding plane network element to publish routing information to the outside based on the session information, wherein a destination address of the routing information is the IP address.
de_de: Senden, durch das Steuerungsebenen-Netzwerkelement, der Sitzungsinformationen an das Weiterleitungsebenen-Netzwerkelement, um das Weiterleitungsebenen-Netzwerkelement in die Lage zu versetzen, Routinginformationen basierend auf den Sitzungsinformationen nach außen zu veröffentlichen, wobei eine Zieladresse der Routinginformationen die IP-Adresse ist.

source: 7. A dial-up packet processing method, applied to a dial-up packet processing system, wherein the system comprises a forwarding plane network element and a control plane network element that are connected to each other, a controller and an access gateway, wherein the control plane network element performs the method according to any one of claims 1 to 6.
de_de: 7. Einwahlpaket-Verarbeitungsverfahren, das auf ein Einwahlpaket-Verarbeitungssystem angewendet wird, wobei das System ein Weiterleitungsebenen-Netzwerkelement und ein Steuerungsebenen-Netzwerkelement, die miteinander verbunden sind, eine Steuerung und ein Zugangs-Gateway umfasst, wobei das Steuerungsebenen-Netzwerkelement das Verfahren nach einem der Ansprüche 1 bis 6 durchführt.

source: 8. The method according to claim 7, wherein the method comprises:
de_de: 8. Verfahren nach Anspruch 7, wobei das Verfahren Folgendes umfasst:

source: receiving, by the forwarding plane network element, a tunnel establishment request from the access gateway, wherein the tunnel establishment request is used to establish a communication tunnel between the access gateway and the forwarding plane network element, and the tunnel establishment request is generated by the controller based on information that is about the forwarding plane network element and that is sent by the control plane network element after the control plane network element determines the forwarding plane network element after receiving a dial-up packet sent by user equipment, wherein the dial-up packet comprises an internet protocol IP address of the user equipment; and
de_de: Empfangen, durch das Weiterleitungsebenen-Netzwerkelement, einer Tunnelaufbauanforderung von dem Zugangs-Gateway, wobei die Tunnelaufbauanforderung verwendet wird, um einen Kommunikationstunnel zwischen dem Zugangs-Gateway und dem Weiterleitungsebenen-Netzwerkelement aufzubauen, und die Tunnelaufbauanforderung durch die Steuerung erzeugt wird basierend auf Informationen über das Weiterleitungsebenen-Netzwerkelement, die durch das Steuerungsebenen-Netzwerkelement gesendet werden, nachdem das Steuerungsebenen-Netzwerkelement das Weiterleitungsebenen-Netzwerkelement nach dem Empfangen eines durch das Benutzergerät gesendeten Einwahlpakets bestimmt, wobei das Einwahlpaket eine Internetprotokoll-IP-Adresse des Benutzergeräts umfasst; und

source: establishing, by the forwarding plane network element, the communication tunnel to the access gateway, wherein the communication tunnel is in a correspondence with the IP address.
de_de: Aufbauen, durch das Weiterleitungsebenen-Netzwerkelement, des Kommunikationstunnels zu dem Zugangs-Gateway, wobei der Kommunikationstunnel in einer Korrespondenz mit der IP-Adresse steht.

source: 9. The method according to claim 8, wherein the information about the forwarding plane network element comprises interface information of the forwarding plane network element and interface information of the access gateway.
de_de: 9. Verfahren nach Anspruch 8, wobei die Informationen über das Weiterleitungsebenen-Netzwerkelement Schnittstelleninformationen des Weiterleitungsebenen-Netzwerkelements und Schnittstelleninformationen des Zugangs-Gateways umfassen.

source: The method according to claim 8 or 9, wherein dial-up success information comprises service level agreement SLA information corresponding to the IP address, and the forwarding plane network element is determined based on the SLA information in the dial-up success information returned by an external server, after the control plane network element generates an authentication request based on the dial-up packet and sends the authentication request to the external server.
de_de: Verfahren nach Anspruch 8 oder 9, wobei die Einwahlerfolgsinformationen Dienstgütevereinbarungs-, SLA-, Informationen umfassen, die der IP-Adresse entsprechen, und das Weiterleitungsebenen-Netzwerkelement basierend auf den SLA-Informationen in den Einwahlerfolgsinformationen bestimmt wird, die von einem externen Server zurückgegeben werden, nachdem das Steuerungsebenen-Netzwerkelement eine Authentifizierungsanforderung basierend auf dem Einwahlpaket erzeugt und die Authentifizierungsanforderung an den externen Server sendet.

source: The method according to claim 8, wherein the method further comprises:
de_de: Verfahren nach Anspruch 8, wobei das Verfahren ferner Folgendes umfasst:

source: receiving, by the forwarding plane network element, a data packet from the access gateway through the communication tunnel, wherein a source IP address of the data packet is the IP address.
de_de: Empfangen, durch das Weiterleitungsebenen-Netzwerkelement, eines Datenpakets von dem Zugangs-Gateway durch den Kommunikationstunnel, wobei eine Quell-IP-Adresse des Datenpakets die IP-Adresse ist.

source: The method according to any one of claims 8 to 11, wherein the method further comprises:
de_de: Verfahren nach einem der Ansprüche 8 bis 11, wobei das Verfahren ferner Folgendes umfasst:

source: receiving, by the forwarding plane network element, session information sent by the control plane network element, wherein the session information is generated by the forwarding plane network element based on the dial-up success information returned by the external server, and the session information corresponds to the IP address; and
de_de: Empfangen von durch das Steuerungsebenen-Netzwerkelement gesendeten Sitzungsinformationen durch das Weiterleitungsebenen-Netzwerkelement, wobei die Sitzungsinformationen durch das Weiterleitungsebenen-Netzwerkelement basierend auf den durch den externen Server zurückgegebenen Einwahlerfolgsinformationen erzeugt werden und die Sitzungsinformationen mit der IP-Adresse korrespondieren; und

source: publishing, by the forwarding plane network element, routing information to the outside based on the session information, wherein a destination address of the routing information is the IP address.
de_de: Veröffentlichen von Routinginformationen durch das Weiterleitungsebenen-Netzwerkelement nach außen basierend auf den Sitzungsinformationen, wobei eine Zieladresse der Routinginformationen die IP-Adresse ist.

source: A dial-up packet processing system, wherein the system comprises a forwarding plane network element, and a control plane network element that are connected to each other, a controller and an access gateway, wherein the system performs the method according to any one of claims 7 to 12.
de_de: Einwahlpaketverarbeitungssystem, wobei das System ein Weiterleitungsebenen-Netzwerkelement und ein Steuerungsebenen-Netzwerkelement, die miteinander verbunden sind, eine Steuerung und ein Zugangs-Gateway umfasst, wobei das System das Verfahren nach einem der Ansprüche 7 bis 12 durchführt.

source: A computer-readable storage medium, comprising instructions, wherein when the instructions are run on a computing device, the computing device is enabled to perform the method according to any one of claims 1 to 6.
de_de: Computerlesbares Speichermedium, das Anweisungen umfasst, wobei, wenn die Anweisungen auf einer Rechenvorrichtung ausgeführt werden, die Rechenvorrichtung in die Lage versetzt wird, das Verfahren nach einem der Ansprüche 1 bis 6 durchzuführen.

source: A network device, comprising a processor and a memory, wherein the processor executes code in the memory to perform the method according to any one of claims 1 to 6.
de_de: Netzwerkvorrichtung, umfassend einen Prozessor und einen Speicher, wobei der Prozessor Code in dem Speicher ausführt, um das Verfahren nach einem der Ansprüche 1 bis 6 durchzuführen.

source: CONNECTION RESUME REQUEST METHOD AND APPARATUS
de_de: VERBINDUNGSWIEDERAUFNAHMEANFORDERUNGSVERFAHREN UND -VORRICHTUNG

source: [0001] This application claims priority to Chinese Patent Application No. 201711138495.4, filed with the China National Intellectual Property Administration on November 16, 2017 and entitled "CONNECTION RESUME REQUEST METHOD AND APPARATUS", and to Chinese Patent Application No. 201810149050.4, filed with the China National Intellectual Property Administration on February 13, 2018 and entitled "CONNECTION RESUME REQUEST METHOD AND APPARATUS''.
de_de: [0001] Diese Anmeldung beansprucht die Priorität der chinesischen Patentanmeldung Nr. 201711138495,4, eingereicht bei der chinesischen nationalen Behörde für geistiges Eigentum am 16. November 2017 und mit dem Titel „VERBINDUNGSWIEDERAUFNAHMEANFORDERUNGSVERFAHREN UND -VORRICHTUNG“, und der chinesischen Patentanmeldung Nr. 201810149050,4, eingereicht bei der chinesischen nationalen Behörde für geistiges Eigentum am 13. Februar 2018 und mit dem Titel „VERBINDUNGSWIEDERAUFNAHMEANFORDERUNGSVERFAHREN UND -VORRICHTUNG“.

source: TECHNICAL FIELD
de_de: TECHNISCHES GEBIET

source: [0002] This application relates to the field of mobile communications technologies, and in particular, to a connection resume request method and an apparatus.
de_de: [0002] Diese Anmeldung betrifft das Gebiet der Mobilkommunikationstechnologien und insbesondere ein Verbindungswiederaufnahmeanforderungsverfahren und eine -vorrichtung.

source: BACKGROUND
de_de: HINTERGRUND

source: [0003] In long term evolution (long term evolution, LTE), a suspend and resume procedure may be applied to a narrowband internet of things (narrowband internet of things, NB-IoT) terminal, namely, an internet of things device with relatively low mobility or low power consumption, such as a smart water meter.
de_de: [0003] Bei der Langzeitentwicklung (Long Term Evolution, LTE) kann ein Aussetzungs- und Wiederaufnahmevorgang auf ein Schmalband-Internet-der-Dinge-(narrowband internet of things, NB-IoT-)Endgerät angewendet werden, nämlich eine Internet-der-Dinge-Vorrichtung mit relativ geringer Mobilität oder geringem Stromverbrauch, wie etwa ein intelligenter Wasserzähler.

source: [0004] When a base station instructs, in a suspend manner, the terminal to release a current connection, the terminal and the base station delete a part of access stratus contexts, and further retain a part of the access stratus contexts, such as an access stratum key, a security capability of the terminal, and a currently selected security algorithm.
de_de: [0004] Wenn eine Basisstation auf eine Aussetzungsweise das Endgerät anweist, eine aktuelle Verbindung freizugeben, löschen das Endgerät und die Basisstation einen Teil von Zugriffsschichtkontexten und behalten ferner einen Teil der Zugriffsschichtkontexte bei, wie etwa einen Zugriffsschichtschlüssel, eine Sicherheitsfähigkeit des Endgeräts und einen aktuell ausgewählten Sicherheitsalgorithmus.

source: Then, the terminal enters an inactive state from a connected state.
de_de: Dann tritt das Endgerät aus einem verbundenen Zustand in einen inaktiven Zustand ein.

source: When the terminal expects to resume the connection to the base station, the terminal may quickly resume from the inactive state to the connected state.
de_de: Wenn das Endgerät erwartet, die Verbindung mit der Basisstation wieder aufzunehmen, kann das Endgerät schnell aus dem inaktiven Zustand in den verbundenen Zustand zurückkehren.
